Cleaned and improved readme
